app/controllers/users_controller.rb

INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "login", "name_first", "name_last", "email_address", "last_login_ip", "created_at") VALUES(NULL, '2009-05-12 04:32:58', '2009-05-12 04:32:58', 'c6688c9b94104efedf972413797a648fff2569e6c4b4739af2aace54f04a0e532f9093ad7bef56d36146dd7f7dcfacabb6a92504cbd8258978603b0c1cdac0c6', 'elPi-7eQb3g8-8wW5KCX', 'I3QIiYnFrNvQNowMta55', '127.0.0.1', 'lr9r72esTmxVRqWZN_f0', '2009-05-12 04:32:58', 0, 'bb7ee32597394bfeaabd9fd7b29a5e69aa1b77e349ae2e75ced14206db55cafd7ccafdf8c20b72f424d66e39982fcfd8cbd5b13e76f45a207fb85e356709f228', 1, 'jabbott', 'Joshua', 'Abbott', 'jabbott@oakley.com', NULL, '2009-05-12 04:32:58')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save